app/controllers/users_controller.rb

   def create
      #@user = User.new(params[:user]) ->次に変更
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "unko"], ["email", "unko@unko.com"], ["created_at", "2018-07-22 07:53:49.282321"], ["updated_at", "2018-07-22 07:53:49.282321"]]

   def following  #14.25
      @title = "Following"
      @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def followers  #14.25
      @title = "Followers"
      @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]